ИС_СПОРТ_2022/src/Documents/ПереводСпортсменовНаЭтап/ПереводСпортсменовНаЭтап.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПереводСпортсменовНаЭтап</name>
  <basedOn>Document.ЗачислениеСпортсменовНаЭтап</basedOn>
  <registerRecords>InformationRegister.ЭтапыСпортивнойПодготовкиСпортсменов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>Этап</name>
    <type>
      <types>CatalogRef.ЭтапыСпортивнойПодготовки</types>
    </type>
  </attributes>
  <attributes>
    <name>Тренер</name>
    <type>
      <types>CatalogRef.Тренеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПеревода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпортивнаяПрограмма</name>
    <type>
      <types>CatalogRef.СпортивныеПрограммы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РезультатыСдачиКонтрольноПереводныхНормативов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТренерПредыдущий</name>
    <type>
      <types>CatalogRef.Тренеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПредыдущий</name>
    <type>
      <types>CatalogRef.ЭтапыСпортивнойПодготовки</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставСпортсмены</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпортивнаяПрограммаПредыдущий</name>
    <type>
      <types>CatalogRef.СпортивныеПрограммы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Спортсмены</name>
    <attributes>
      <name>Спортсмен</name>
      <type>
        <types>CatalogRef.Спортсмены</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/InformationRegisters/ПодтвержденныеРазрядыСпортсменов/ПодтвержденныеРазрядыСпортсменов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПодтвержденныеРазрядыСпортсменов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаПрисвоения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПодтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Разряд</name>
    <type>
      <types>CatalogRef.СпортивнаяКлассификация</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаПодтверждающегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПодтверждающегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазрядУдалить</name>
    <type>
      <types>CatalogRef.СпортивнаяКлассификация</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИС_СПОРТ_2022/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФамилияЛатиница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяЛатиница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтчествоЛатиница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодРождения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПолисаОМС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИС_СПОРТ_2022/src/Documents/ПереводСпортсменовНаЭтап/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"      	, ДокументСсылка);
	// {Рарус adilas #10048 -Реквизиты дат для документов 2020.10.09
	Запрос.УстановитьПараметр("Период"        	, ДокументСсылка.ДатаПеревода);
	// }Рарус adilas #10048 -Реквизиты дат для документов 2020.10.09
	Запрос.УстановитьПараметр("Организация" 	, ДокументСсылка.Организация);
	Запрос.УстановитьПараметр("Тренер"      	, ДокументСсылка.Тренер);
	Запрос.УстановитьПараметр("ВидСпорта"   	, ДокументСсылка.ВидСпорта);
	Запрос.УстановитьПараметр("Этап"        	, ДокументСсылка.Этап);
	//{ lobash IN-9622 
	Запрос.УстановитьПараметр("СпортивнаяПрограмма" , ДокументСсылка.СпортивнаяПрограмма);
	//} lobash IN-9622 
	Запрос.Текст =  "ВЫБРАТЬ
	                |	""ЭтапыСпортивнойПодготовкиСпортсменов"" КАК ИмяРегистра_,
	                |	&Период КАК Период,
	                |	&Организация КАК Организация,
	                |	&ВидСпорта КАК ВидСпорта,
	                |	&Этап КАК Этап,
	                |	Спортсмены.Спортсмен КАК Спортсмен,
					//{ lobash IN-9622 
	                |	&СпортивнаяПрограмма КАК СпортивнаяПрограмма,
					//} lobash IN-9622 
	                |	&Тренер КАК Тренер
	                |ИЗ
	                |	Документ.ПереводСпортсменовНаЭтап.Спортсмены КАК Спортсмены
	                |ГДЕ
	                |	Спортсмены.Ссылка = &Ссылка";
					
	
	ТаблицаЭтапыСпортивнойПодготовкиСпортсменов = Запрос.Выполнить().Выгрузить();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаЭтапыСпортивнойПодготовкиСпортсменов" , ТаблицаЭтапыСпортивнойПодготовкиСпортсменов);
	
    ДополнительныеСвойства.Вставить("Отказ", Отказ);
	
КонецПроцедуры	

Процедура ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ПереводСпортсменовНаЭтап.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольПередПроведением(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ПереводСпортсменовНаЭтап.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовОтменыПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ПереводСпортсменовНаЭтап.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

#Область ПечатьWord
// {Рарус adilas #18907 -Печатная форма. Приказ о переводе на этап от одного тренера к другому 2021.08.02

// Подготавливает данные объекта к выводу на печать.
// 
// Параметры:
//  Согласия - Массив - ссылки на документы, для которых запрашиваются данные для печати;
//  МассивИменМакетов - Массив - имена макетов (Строка), в которые подставляются данные для печати.
//
// Возвращаемое значение:
//  Соответствие - коллекция ссылок на объекты и их данные:
//   * Ключ - ЛюбаяСсылка - ссылка на объект информационной базы;
//   * Значение - Структура - макет и данные:
//    ** Ключ - Строка - имя макета,
//    ** Значение - Структура - данные объекта.
//
Функция ПолучитьДанныеПечати(Знач МассивДокументов, Знач МассивИменМакетов) Экспорт
	
	// Создание функции подготовки данных для печати.
	ДанныеПоВсемОбъектам = Новый Соответствие;
	
	Для Каждого ОбъектСсылка Из МассивДокументов Цикл
		ДанныеОбъектаПоМакетам = Новый Соответствие;
		Для Каждого ИмяМакета Из МассивИменМакетов Цикл
			ДанныеОбъектаПоМакетам.Вставить(ИмяМакета, ПолучитьДанныеОбъекта(ОбъектСсылка,ИмяМакета));
		КонецЦикла;
		ДанныеПоВсемОбъектам.Вставить(ОбъектСсылка, ДанныеОбъектаПоМакетам);
	КонецЦикла;
	
	ОписаниеОбластей = Новый Соответствие;
	ДвоичныеДанныеМакетов = Новый Соответствие;
	ТипыМакетов = Новый Соответствие;
	                                                             
	Для Каждого ИмяМакета Из МассивИменМакетов Цикл
		Если ИмяМакета = "ПФ_DOC_ПриказОПереводеСЭтапаНаЭтап" Тогда
			ДвоичныеДанныеМакетов.Вставить(ИмяМакета, Документы.ПереводСпортсменовНаЭтап.ПолучитьМакет("ПФ_DOC_ПриказОПереводеСЭтапаНаЭтап"));
			ТипыМакетов.Вставить(ИмяМакета, "DOC");
		КонецЕсли;
		ОписаниеОбластей.Вставить(ИмяМакета, ПолучитьОписаниеОбластейМакетаОфисногоДокумента(ИмяМакета));
	КонецЦикла;

	Возврат Новый Структура("Данные, Макеты",
											ДанныеПоВсемОбъектам,
											Новый Структура("ОписаниеОбластей, ТипыМакетов, ДвоичныеДанныеМакетов",
											ОписаниеОбластей,
											ТипыМакетов,
											ДвоичныеДанныеМакетов));
											
КонецФункции

Функция ПолучитьОписаниеОбластейМакетаОфисногоДокумента(ИмяМакета)
	
	ОписаниеОбластей = Новый Структура;
	
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ОбластьШапка"        			, "Общая"); // Описание областей в вордовском документе
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ОбластьВидСпорта"        		, "Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ОбластьШапкаТаблицы"        	, "Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ОбластьСтрокаТаблицыСпортсмены", "СтрокаТаблицы");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ОбластьТренер"        			, "Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ОбластьПодвал"     			, "Общая");
	
	Возврат ОписаниеОбластей;
	
КонецФункции

Функция ПолучитьДанныеОбъекта(ОбъектыПечати, ИмяМакета) Экспорт
	Если ИмяМакета = "ПФ_DOC_ПриказОПереводеСЭтапаНаЭтап" Тогда
		Возврат ПолучитьДанныеОбъектаПриказ(ОбъектыПечати);
	КонецЕсли;
КонецФункции

Функция ПолучитьДанныеОбъектаПриказ(ОбъектыПечати)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПереводСпортсменовНаЭтап.Ссылка КАК Ссылка,
		|	ПереводСпортсменовНаЭтап.ВидСпорта КАК ВидСпорта
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	Документ.ПереводСпортсменовНаЭтап КАК ПереводСпортсменовНаЭтап
		|ГДЕ
		|	ПереводСпортсменовНаЭтап.Ссылка В(&СписокДокументов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Данные.Ссылка КАК Ссылка,
		|	ПереводСпортсменовНаЭтапСпортсмены.Спортсмен КАК Спортсмен,
		|	ВТ_Данные.ВидСпорта КАК ВидСпорта
		|ПОМЕСТИТЬ ВТ_ТаблицаДляИтогов
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПереводСпортсменовНаЭтап.Спортсмены КАК ПереводСпортсменовНаЭтапСпортсмены
		|		ПО ВТ_Данные.Ссылка = ПереводСпортсменовНаЭтапСпортсмены.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен КАК Спортсмен,
		|	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПрисвоения) КАК ДатаПрисвоения,
		|	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПодтверждения) КАК ДатаПодтверждения,
		|	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд КАК Разряд
		|ПОМЕСТИТЬ ВТ_Разряды
		|ИЗ
		|	РегистрСведений.ПодтвержденныеРазрядыСпортсменов.СрезПоследних(, ) КАК ПодтвержденныеРазрядыСпортсменовСрезПоследних
		|ГДЕ
		|	(ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен, ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта) В
		|			(ВЫБРАТЬ
		|				ВТ_ТаблицаДляИтогов.Спортсмен,
		|				ВТ_ТаблицаДляИтогов.ВидСпорта
		|			ИЗ
		|				ВТ_ТаблицаДляИтогов КАК ВТ_ТаблицаДляИтогов)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен,
		|	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ТаблицаДляИтогов.Ссылка КАК Ссылка,
		|	ВТ_ТаблицаДляИтогов.Спортсмен КАК Спортсмен,
		|	ЕСТЬNULL(ВТ_Разряды.Разряд, ""б/р"") КАК Разряд,
		|	ФизическиеЛица.ГодРождения КАК ГодРождения
		|ИЗ
		|	ВТ_ТаблицаДляИтогов КАК ВТ_ТаблицаДляИтогов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Разряды КАК ВТ_Разряды
		|		ПО ВТ_ТаблицаДляИтогов.Спортсмен = ВТ_Разряды.Спортсмен
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО ВТ_ТаблицаДляИтогов.Спортсмен.ФизическоеЛицо = ФизическиеЛица.Ссылка
		|ИТОГИ ПО
		|	Ссылка,
		|	ВТ_ТаблицаДляИтогов.Ссылка.ВидСпорта КАК ВидСпорта,
		|	ВТ_ТаблицаДляИтогов.Ссылка.Этап КАК Этап";
	
	Запрос.УстановитьПараметр("СписокДокументов", ОбъектыПечати);
	
	МассивДокументов = Новый Массив;
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСсылка.Следующий() Цикл
			
			СтруктураДокумента = Новый Структура;
			
			Если ВыборкаСсылка.Ссылка.ТренерПредыдущий = ВыборкаСсылка.Ссылка.Тренер Тогда	
				ТекстШапки = НСтр("ru = 'Перевести с " + Формат(ВыборкаСсылка.Ссылка.ДатаПеревода, "ДЛФ=D") + 
					" года на следующий этап подготовки и закрепить за тренером спортсменов:'");
			Иначе
				ТекстШапки = НСтр("ru = 'Перевести с " + Формат(ВыборкаСсылка.Ссылка.ДатаПеревода, "ДЛФ=D") + 
					" года от тренера к тренеру и закрепить по этапам подготовки спортсменов:'");
			КонецЕсли;
			
			СтруктураШапка = Новый Структура;
			СтруктураШапка.Вставить("ПолноеНаименование", ВРег(ВыборкаСсылка.Ссылка.Организация.ПолноеНаименование));
			СтруктураШапка.Вставить("НомерДокумента", ВыборкаСсылка.Ссылка.НомерДокумента);
			СтруктураШапка.Вставить("ДатаДокумента", Формат(ВыборкаСсылка.Ссылка.ДатаДокумента, "ДЛФ=D"));
			СтруктураШапка.Вставить("ТекстШапки", ТекстШапки);
			СтруктураДокумента.Вставить("ОбластьШапка", СтруктураШапка);
			
			МассивВидовСпорта = Новый Массив;
			
			ВыборкаВидСпорта = ВыборкаСсылка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаВидСпорта.Следующий() Цикл
				
				СтруктураВидСпорта = Новый Структура;
				//Если ЗначениеЗаполнено(ВыборкаВидСпорта.Ссылка.ВидСпорта.Родитель) Тогда 
				//	СтруктураВидСпорта.Вставить("ВидСпорта", ВРег(ВыборкаВидСпорта.Ссылка.ВидСпорта.Родитель));
				//Иначе
					СтруктураВидСпорта.Вставить("ВидСпорта", ВРег(ВыборкаВидСпорта.Ссылка.ВидСпорта));
				//КонецЕсли;
			
				СтруктураОбластиВидСпорта = Новый Структура;
				СтруктураОбластиВидСпорта.Вставить("ОбластьВидСпорта", СтруктураВидСпорта);
				
				МассивВидовСпорта.Добавить(СтруктураОбластиВидСпорта);
				
				МассивЭтапов = Новый Массив;
				
				ВыборкаЭтап = ВыборкаВидСпорта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаЭтап.Следующий() Цикл
					
					СтруктураШапкаТаблицы = Новый Структура;
					
					Если ВыборкаСсылка.Ссылка.ТренерПредыдущий = ВыборкаСсылка.Ссылка.Тренер Тогда
						ТекстШапкиТаблицы = НСтр("ru = 'с этапа " + ВыборкаСсылка.Ссылка.ЭтапПредыдущий + 
						" на этап " + ВыборкаСсылка.Ссылка.Этап + "'");
					Иначе
						
						ТренерПредыдущий = СклонениеПредставленийОбъектов.ПросклонятьФИО(Строка(ВыборкаЭтап.Ссылка.ТренерПредыдущий.ФизическоеЛицо), 2);
						ТренерПредыдущий = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ТренерПредыдущий);
						Тренер = СклонениеПредставленийОбъектов.ПросклонятьФИО(Строка(ВыборкаЭтап.Ссылка.Тренер.ФизическоеЛицо), 3);
						Тренер = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Тренер);
						
						ТекстШапкиТаблицы = НСтр("ru = 'от тренера " + ТренерПредыдущий + 
						" с этапа " + ВыборкаСсылка.Ссылка.ЭтапПредыдущий + " к тренеру " + Тренер + 
						" на этап " + ВыборкаСсылка.Ссылка.Этап + "'");
					КонецЕсли;
					
					СтруктураШапкаТаблицы.Вставить("ТекстШапкиТаблицы", ТекстШапкиТаблицы);
					
					СтруктураОбластиШапкаТаблицы = Новый Структура;
					СтруктураОбластиШапкаТаблицы.Вставить("ОбластьШапкаТаблицы", СтруктураШапкаТаблицы);
					МассивЭтапов.Добавить(СтруктураОбластиШапкаТаблицы);
		
					МассивСтрокСпортсмены = Новый Массив;
					НомерСтрокиСпр = 1;
					
					ВыборкаДетальныеЗаписи = ВыборкаЭтап.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						
						Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Спортсмен) Тогда
							
							СтруктураСтрокаСпортсмены = Новый Структура("НомерСтроки, Спортсмен, ГодРождения, Разряд");
							ЗаполнитьЗначенияСвойств(СтруктураСтрокаСпортсмены, ВыборкаДетальныеЗаписи);
							СтруктураСтрокаСпортсмены.НомерСтроки 	= Строка(НомерСтрокиСпр) + ".";
							НомерСтрокиСпр 							= НомерСтрокиСпр + 1;
							// Фамилия и Имя
							ЧастиИмени 								= СтрРазделить(ВыборкаДетальныеЗаписи.Спортсмен, " ", Ложь);
							Фамилия 								= ЧастиИмени[0];
							Имя 									= ЧастиИмени[1];
							СтруктураСтрокаСпортсмены.Спортсмен 	= Фамилия + " " + Имя;
							МассивСтрокСпортсмены.Добавить(СтруктураСтрокаСпортсмены);	
						Иначе
							ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Добавьте спортсменов которым необходимо присвоить разряд!'"));
						КонецЕсли;	
					КонецЦикла;
					
					МассивЭтапов.Добавить(МассивСтрокСпортсмены);
					
					СтруктураТренер = Новый Структура;
					
					Если ВыборкаСсылка.Ссылка.ТренерПредыдущий = ВыборкаСсылка.Ссылка.Тренер Тогда	
						
						ТренерСледующий = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаЭтап.Ссылка.Тренер.ФизическоеЛицо);
						Тренер = СклонениеПредставленийОбъектов.ПросклонятьФИО(Строка(ВыборкаЭтап.Ссылка.Тренер.ФизическоеЛицо), 2);
						Тренер = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Тренер);
						ТекстТренер = НСтр("ru = 'Тренер " + ТренерСледующий + Символы.ПС + Символы.ПС + 
							"Основание: заявление тренера " + Тренер + "'");
						СтруктураТренер.Вставить("ТекстТренер", ТекстТренер);
					Иначе
						
						Тренер = СклонениеПредставленийОбъектов.ПросклонятьФИО(Строка(ВыборкаЭтап.Ссылка.Тренер.ФизическоеЛицо), 2);
						Тренер = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Тренер);
						ТекстТренер = "";
						ТекстТренер = НСтр("ru = '" + ТекстТренер + Символы.ПС + Символы.ПС +
							"Основание: заявление тренера " + Тренер + "'");
						СтруктураТренер.Вставить("ТекстТренер", ТекстТренер);
						
					КонецЕсли;
					
					СтруктураОбластиТренер = Новый Структура;
					СтруктураОбластиТренер.Вставить("ОбластьТренер", СтруктураТренер);
						
				КонецЦикла;
				
				МассивВидовСпорта.Добавить(МассивЭтапов);
				МассивВидовСпорта.Добавить(СтруктураОбластиТренер);
				
			КонецЦикла;
			// Подвал
			СтруктураПодвал = Новый Структура;
			СтруктураПодвал.Вставить("Директор", ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаСсылка.Ссылка.Организация.Директор));
		
			СтруктураДокумента.Вставить("МассивВидовСпорта", МассивВидовСпорта);
			СтруктураДокумента.Вставить("ОбластьПодвал", СтруктураПодвал);
			
			МассивДокументов.Добавить(СтруктураДокумента);

		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивДокументов
	
КонецФункции	

#КонецОбласти

#Область Печать

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт 
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПриказПереводНаЭтап") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_ПриказПереводНаЭтап", "Приказ о переводе спортсменов с этапа на этап", СформироватьПечатнуюФормуПриказОПереводе(МассивОбъектов));
		
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуПриказОПереводе(МассивОбъектовДляПечати) Экспорт
	
	Если ТипЗнч(МассивОбъектовДляПечати) = Тип("Массив") Тогда	
		МассивОбъектов = МассивОбъектовДляПечати;	
	Иначе	
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(МассивОбъектовДляПечати);	
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПереводСпортсменовНаЭтап.Ссылка КАК Ссылка,
		|	ПереводСпортсменовНаЭтап.ДатаПеревода КАК ДатаПеревода
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	Документ.ПереводСпортсменовНаЭтап КАК ПереводСпортсменовНаЭтап
		|ГДЕ
		|	ПереводСпортсменовНаЭтап.Ссылка В(&МассивОбъектов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Данные.Ссылка КАК Ссылка,
		|	ПереводСпортсменовНаЭтапСпортсмены.Спортсмен КАК Спортсмен,
		|	ВидыСпорта.Ссылка КАК ВидСпорта,
		|	ВТ_Данные.ДатаПеревода КАК ДатаПеревода
		|ПОМЕСТИТЬ ВТ_ТаблицаДляИтогов
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПереводСпортсменовНаЭтап.Спортсмены КАК ПереводСпортсменовНаЭтапСпортсмены
		|		ПО ВТ_Данные.Ссылка = ПереводСпортсменовНаЭтапСпортсмены.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыСпорта КАК ВидыСпорта
		|		ПО ВТ_Данные.Ссылка.ВидСпорта = ВидыСпорта.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация КАК Организация,
		|	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен КАК Спортсмен,
		|	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта КАК ВидСпорта,
		|	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПрисвоения) КАК ДатаПрисвоения,
		|	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПодтверждения) КАК ДатаПодтверждения,
		|	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд КАК Разряд
		|ПОМЕСТИТЬ ВТ_Разряды
		|ИЗ
		|	РегистрСведений.ПодтвержденныеРазрядыСпортсменов.СрезПоследних(, ) КАК ПодтвержденныеРазрядыСпортсменовСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация,
		|	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен,
		|	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта,
		|	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ТаблицаДляИтогов.Ссылка КАК Ссылка,
		|	ВТ_ТаблицаДляИтогов.Спортсмен КАК Спортсмен,
		|	ВТ_ТаблицаДляИтогов.ВидСпорта КАК ВидСпорта,
		|	ЕСТЬNULL(ВТ_Разряды.Разряд, ""б/р"") КАК Разряд,
		|	ФизическиеЛица.ГодРождения КАК ГодРождения,
		|	ВТ_ТаблицаДляИтогов.ДатаПеревода КАК ДатаПеревода
		|ИЗ
		|	ВТ_ТаблицаДляИтогов КАК ВТ_ТаблицаДляИтогов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Разряды КАК ВТ_Разряды
		|		ПО ВТ_ТаблицаДляИтогов.Спортсмен = ВТ_Разряды.Спортсмен
		|			И ВТ_ТаблицаДляИтогов.ВидСпорта = ВТ_Разряды.ВидСпорта
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО ВТ_ТаблицаДляИтогов.Спортсмен.ФизическоеЛицо = ФизическиеЛица.Ссылка
		|ИТОГИ ПО
		|	Ссылка,
		|	ВТ_ТаблицаДляИтогов.Ссылка.ВидСпорта КАК ВидСпорта,
		|	ВТ_ТаблицаДляИтогов.Ссылка.Этап КАК Этап";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектовДляПечати);
	
	ПутьКМакету = "Документ.ПереводСпортсменовНаЭтап.ПФ_MXL_ПриказПереводНаЭтап";
	Макет = УправлениеПечатью.МакетПечатнойФормы(ПутьКМакету); // Получаем макет
	
	ТабДок = Новый ТабличныйДокумент;  // Создаем новый ТабДок
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСсылка.Следующий() Цикл
			
			Если ВыборкаСсылка.Ссылка.ТренерПредыдущий = ВыборкаСсылка.Ссылка.Тренер Тогда	
				ОбластьШапка =  Макет.ПолучитьОбласть("ОбластьШапкаСледующий");
			Иначе
				ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");	
			КонецЕсли;
			
			ОбластьШапка.Параметры.ПолноеНаименование 	= ВРег(ВыборкаСсылка.Ссылка.Организация.ПолноеНаименование);
			ОбластьШапка.Параметры.НомерДокумента 		= ВыборкаСсылка.Ссылка.НомерДокумента;
			ОбластьШапка.Параметры.ДатаДокумента 		= Формат(ВыборкаСсылка.Ссылка.ДатаДокумента, "ДЛФ=D");
			ОбластьШапка.Параметры.ДатаПеревода 		= Формат(ВыборкаСсылка.Ссылка.ДатаПеревода, "ДЛФ=D");
			ТабДок.Вывести(ОбластьШапка);
	
			ВыборкаВидСпорта = ВыборкаСсылка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаВидСпорта.Следующий() Цикл
				
				ОбластьВидСпорта = Макет.ПолучитьОбласть("ОбластьВидСпорта");
				
				//Если ЗначениеЗаполнено(ВыборкаВидСпорта.Ссылка.ВидСпорта.Родитель) Тогда 
				//	ОбластьВидСпорта.Параметры.ВидСпорта = ВРег(ВыборкаВидСпорта.Ссылка.ВидСпорта.Родитель);
				//Иначе
					ОбластьВидСпорта.Параметры.ВидСпорта = ВРег(ВыборкаВидСпорта.Ссылка.ВидСпорта);
				//КонецЕсли;
				
				ТабДок.Вывести(ОбластьВидСпорта);
				
				ВыборкаЭтап = ВыборкаВидСпорта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаЭтап.Следующий() Цикл

					Если ВыборкаЭтап.Ссылка.ТренерПредыдущий = ВыборкаЭтап.Ссылка.Тренер Тогда	
						ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ОбластьШапкаТаблицыСЭтапаНаЭтап");		
					Иначе
						ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ОбластьШапкаТаблицыОтТренераКТренеру");
						ТренерПредыдущий = СклонениеПредставленийОбъектов.ПросклонятьФИО(Строка(ВыборкаЭтап.Ссылка.ТренерПредыдущий.ФизическоеЛицо), 2);
						ТренерПредыдущий = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ТренерПредыдущий);
						ОбластьШапкаТаблицы.Параметры.ТренерПредыдущий = ТренерПредыдущий;
						Тренер = СклонениеПредставленийОбъектов.ПросклонятьФИО(Строка(ВыборкаЭтап.Ссылка.Тренер.ФизическоеЛицо), 3);
						Тренер = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Тренер);
						ОбластьШапкаТаблицы.Параметры.Тренер = Тренер;
					КонецЕсли;
					
					ОбластьШапкаТаблицы.Параметры.ЭтапПредыдущий = ВыборкаЭтап.Ссылка.ЭтапПредыдущий;
					ОбластьШапкаТаблицы.Параметры.Этап = ВыборкаЭтап.Ссылка.Этап;
					ТабДок.Вывести(ОбластьШапкаТаблицы);
					
					НомерСтрокиСпр = 1;
					
					ВыборкаДетальныеЗаписи = ВыборкаЭтап.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						
						Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Спортсмен) Тогда
							// Таблица спортсмены
							ОбластьСтрокаТаблицыСпортсмены 							= Макет.ПолучитьОбласть("ОбластьСтрокаТаблицыСпортсмены");
							ОбластьСтрокаТаблицыСпортсмены.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
							ОбластьСтрокаТаблицыСпортсмены.Параметры.НомерСтроки 	= Строка(НомерСтрокиСпр) + ".";
							НомерСтрокиСпр 											= НомерСтрокиСпр + 1;
							// Фамилия и Имя
							ЧастиИмени 												= СтрРазделить(ВыборкаДетальныеЗаписи.Спортсмен, " ", Ложь);
							Фамилия 												= ЧастиИмени[0];
							Имя 													= ЧастиИмени[1];
							ОбластьСтрокаТаблицыСпортсмены.Параметры.Спортсмен 		= Фамилия + " " + Имя;
							ТабДок.Вывести(ОбластьСтрокаТаблицыСпортсмены);
						Иначе
							ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Добавьте спортсменов которых необходимо зачислить на этап!'"));
						КонецЕсли;	
					КонецЦикла;
					
				Если ВыборкаСсылка.Ссылка.ТренерПредыдущий = ВыборкаСсылка.Ссылка.Тренер Тогда	
					ОбластьТренер = Макет.ПолучитьОбласть("ОбластьТренерСледующий");
					ТренерСледующий = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаЭтап.Ссылка.Тренер.ФизическоеЛицо);
					ОбластьТренер.Параметры.ТренерСледующий = ТренерСледующий;
				Иначе
					ОбластьТренер = Макет.ПолучитьОбласть("ОбластьТренер");	
				КонецЕсли;	
					
				Тренер = СклонениеПредставленийОбъектов.ПросклонятьФИО(Строка(ВыборкаЭтап.Ссылка.Тренер.ФизическоеЛицо), 2);
				Тренер = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Тренер);
				ОбластьТренер.Параметры.Тренер = Тренер;
				ТабДок.Вывести(ОбластьТренер);	
					
				КонецЦикла;
			КонецЦикла;
			// Подвал
			ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
			ОбластьПодвал.Параметры.Директор = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаСсылка.Ссылка.Организация.Директор);
			
			ТабДок.Вывести(ОбластьПодвал);	
		КонецЦикла;
	КонецЕсли;
			
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	
	ТабДок.КлючПараметровПечати	= ПутьКМакету;
	ТабДок.ОриентацияСтраницы 	= ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб 			= Истина;
	
	Возврат ТабДок;
	
КонецФункции

#КонецОбласти
// }Рарус adilas #18907 -Печатная форма. Приказ о переводе на этап от одного тренера к другому 2021.08.02

#КонецОбласти
